---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.Displacement
source: html/12b15c87-4a3e-a6ec-9695-a972ec59b466.htm
---
# Autodesk.Revit.DB.SpecTypeId.Displacement Property

Displacement/Deflection, in discipline Structural.

## Syntax (C#)
```csharp
public static ForgeTypeId Displacement { get; }
```